docs/index-en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>BC+ – BoardComputer+ Documentation</title>
<!-- 2018-06-03 So 19:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="bcpdoc.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">BC+ – BoardComputer+ Documentation</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Download</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/CmdrVasquess/BCplus/releases">Binary Downloads</a> can be found on github. The “basic” build, i.e. the
English version, is the file <code>BCplus-&lt;version&gt;.zip</code>. Othe language
packages may become available as <code>BCplus-&lt;lang&gt;-&lt;version&gt;.zip</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Installation</h2>
<div class="outline-text-2" id="text-2">
<p>
Currently BC+ is only build for the PC. To run BC+ no additional
runtime environment, like e.g. Python or Java, is needed. BC+ is
written in <a href="https://golang.org">Go</a> and runs native on your machine. Further more BC+ is
written to run right out of the box without installation. This means
</p>

<ul class="org-ul">
<li>New versions are easy to install. Simply delete the old BCplus
folder and unzip the new one right in place. (May be you wanna keep
the old version around until you are satisfied with the new one?)
</li>

<li>On the other hand no one creates nice start-menu entries or icons on
the desktop for you.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Running and Exit</h2>
<div class="outline-text-2" id="text-3">
<p>
BC+ should be started before running E:D. BC+ watches the journal
directory and starts reading when a new journal file is created (see
also option <code>-l</code>).
</p>

<p>
If you have a standard E:D installation from the Frontier Store simply
double-clicking BCplus.exe will do the job. BC+ should detect necessary
paths by itself:
</p>

<ul class="org-ul">
<li>The E:D journal file folder
</li>

<li>The folder with BC+'s own data files
</li>
</ul>

<p>
Both paths will be displayed in BC+ text console when it starts. If
you don't have the standard installation you have to set the paths on
the command line.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Command Line Options</h3>
<div class="outline-text-3" id="text-3-1">
<p>
First, option syntax is not Windows standard – BC+ is written in <a href="https://golang.org">Go</a>
and uses Go's standard command line parsing package. So be prepared to
start options with '-' not '/'.
</p>

<dl class="org-dl">
<dt> -h </dt><dd>show help information, i.e. the complete and up-to-date list
of options.
</dd>

<dt> -j &lt;directory&gt; </dt><dd>set the path to the directory containig your
journal files.
</dd>

<dt> -d &lt;directory&gt; </dt><dd>set the directory where BC+ collects data about
your commander and the visited galaxy (BC+ can
handle multiple commanders)
</dd>

<dt> -p &lt;port&gt; </dt><dd>set the port on which the web server is listening
(default: 1337).
</dd>
</dl>

<p>
Normal users shouldn't need more options. If you feel that there has
to be more try <code>-h</code> to see the complete list of options. This should
help a little. If even that isn't enough: <i>Use the source, Luke!</i>
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Connecting the Web Browser</h3>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Shutting Down BC+</h3>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">Few Word on Security</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Currently BC+ serves its GUI over HTTP (without 'S'). This means that
data is send as clear text over you local network. Currently there is
no sensitive data transferred: No passwords, users ids etc. Thus HTTP
should be no problem for now.
</p>

<p>
However keep in mind that while BC+ is running any Web Browser in your
net can connect to it. Those user can perform same actions on BC+ as
you do! Keep this in mind.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Uninstall</h2>
<div class="outline-text-2" id="text-4">
<p>
Is <b>absolutely</b> unnecessary! Who would ever delete such a useful,
nice, wonderful… OK, OK, OK. It's simple—just delete
</p>

<ol class="org-ol">
<li>the BCplus folder you unzipped from the download
</li>
<li>the data folder (default: C:\Users\&lt;user&gt;\bcplus)°
</li>
<li>any Browser bookmarks you created
</li>
</ol>

<p>
That's it.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-06-03 So 19:04</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
